#-----------------------------
# Docker イメージのベースイメージ
#-----------------------------
FROM nginx:latest

#-----------------------------
# 基本ライブラリのインストール
#-----------------------------
# インストール時のキー入力待ちをなくす環境変数
ENV DEBIAN_FRONTEND noninteractive

RUN set -x && apt-get update && apt-get install -y --no-install-recommends \
    sudo \
    git \
    curl \
    wget \
    bzip2 \
    ca-certificates \
    libx11-6 \
    python3-pip \
    procps \
    # imageのサイズを小さくするためにキャッシュ削除
    && apt-get clean \
    && rm -rf /var/lib/apt/lists/*

#-----------------------------
# 環境変数
#-----------------------------
ENV LC_ALL=C.UTF-8
ENV export LANG=C.UTF-8
ENV PYTHONIOENCODING utf-8

#-----------------------------
# 追加ライブラリのインストール
#-----------------------------

#-----------------------------
# ソースコードの書き込み
#-----------------------------

#-----------------------------
# ポート開放
#-----------------------------
EXPOSE 8080

#-----------------------------
# コンテナ起動後に自動的に実行するコマンド
#-----------------------------
#CMD ["nginx","-c","/proxy/nginx/proxy.conf", "-g", "daemon off;"]

#-----------------------------
# コンテナ起動後の作業ディレクトリ
#-----------------------------
WORKDIR /proxy
